Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་རྒྱུ་མེད་རྐྱེན་མེད་པར་འཛུམ་པ་མི་མཛད་དོ། །
en: Without the right causes and conditions the tathāgatas, arhats, totally and completely awakened buddhas do not smile.

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་བྲམ་ཟེ་གང་གིས་དེ་བཞིན་གཤེགས་པ་ལ་མེ་ཏོག་གིས་གཏོར་བ་མཐོང་ངམ།
en: Ānanda, did you see the brahmin who scattered flowers on the Tathāgata?”

source: བསྐལ་པ་བཅུ་གསུམ་གྱི་བར་དུ་ལྷ་རྣམས་དང་མི་རྣམས་ཀྱི་ནང་དུ་ཉིང་མཚམས་སྦྱར་ཞིང་འཁོར་བར་གྱུར་ནས།
en: For thirteen eons he will take rebirth among gods and humans.

source: སྲིད་པ་ཐ་མ་དང་གནས་ཐ་མ་ལ་མིར་སྐྱེ་བ་ཐོབ་སྟེ་
en: After circling in saṃsāra, in his final rebirth, his final dwelling place, he will take birth as a human being.

source: རབ་ཏུ་འབྱུང་བར་འགྱུར་ལ་དེས་སློབ་དཔོན་མེད་པ་དང་མན་ངག་མེད་པར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་དང་འཐུན་པའི་ཆོས་སུམ་ཅུ་རྩ་བདུན་མངོན་དུ་བྱས་ནས
en: Then he will go forth and manifest the thirty-seven wings of enlightenment without a teacher or any instruction.

source: རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་ཏེ་རང་སངས་རྒྱས་མེ་ཏོག་བླ་མ་ཞེས་བྱ་བར་འགྱུར་རོ། །
en: He will manifest the enlightenment of a solitary buddha and become the solitary buddha known as Flower Guru.

source: ཤིང་རྟ་བཞི་པ་ནི།
en: The Fourth “Chariot” Story

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་བཅོམ་ལྡན་འདས་མཉན་དུ་ཡོད་པ་ནས་རྒྱལ་པོའི་ཁབ་ཏུ་གཤེགས་སོ། །
en: One day when the Blessed One was in Śrāvastī and was traveling from Śrāvastī to Rājagṛha,

source: བྲམ་ཟེ་ཞིག་ཀྱང་ཤིང་རྟ་ལ་ཞོན་ཏེ་ལམ་དུ་སྣོལ་མར་འགྲོ་བ་ལས།
en: a brahmin riding in a chariot met him along the way.

source: བྲམ་ཟེ་དེས་བཅོམ་ལྡན་འདས་མཐོང་ནས་ཤིང་རྟ་ལས་བབས་ཏེ་བཅོམ་ལྡན་འདས་ལ་ཤིང་རྟ་བསྟབས་སོ། །
en: When the brahmin saw the Blessed One he climbed down from his chariot and offered him the chariot.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དེ་ཉིད་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར། ཤིང་རྟའི་སྟེང་གི་ནམ་མཁའ་ལ་བཞུགས་སོ། །
en: Out of compassion for him the Blessed One hovered in the air above the chariot.

source: དེ་ནས་བྲམ་ཟེ་དེ་རྒྱུ་དེ་ལས་དགའ་བ་ཆེན་པོ་སྐྱེས་སོ། །
en: This delighted the brahmin, and filled with such great delight, [he took leave of the Blessed One.]

source: དགའ་བ་ཆེན་པོ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་སོང་ངོ་། །
en: [and filled with such great delight,] he took leave of the Blessed One.

source: དེའི་སྐབས་སུ་བཅོམ་ལྡན་འདས་ཀྱིས་འཛུམ་པ་མཛད་དོ། །
en: At that moment the Blessed One smiled.

source: འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་གང་གི་ཚེ། འཛུམ་པ་མཛད་པའི་ཆོས་ཉིད་དེ། དེའི་ཚེ་ཞལ་ནས་འོད་ཟེར་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་རྣམས་བྱུང་ནས་ཁ་ཅིག་ནི་འོག་ཏུ་འགྲོའོ། །
en: Now it is the nature of the blessed buddhas’ smiles that when they smile, colorful beams of blue, yellow, red, and white light radiate from their mouths, with some traveling up

source: ཁ་ཅིག་ནི་སྟེང་དུ་འགྲོའོ། །
en: and others traveling down.

source: འོག་ཏུ་འགྲོ་བ་གང་ཡིན་པ་དེ་དག་ནི། སེམས་ཅན་དམྱལ་བ་ཡང་སོས་དང་། ཐིག་ནག་དང་། བསྡུས་འཇོམས་དང་། ངུ་འབོད་དང་། ངུ་འབོད་ཆེན་པོ་དང་། ཚ་བ་དང་། རབ་ཏུ་ཚ་བ་དང་། མནར་མེད་པ་དང་། ཆུ་བུར་ཅན་དང་། ཆུ་བུར་རྡོལ་བ་དང་། སོ་ཐམས་ཐམས་དང་། ཀྱི་ཧུད་ཟེར་བ་དང་། ཨ་ཆུ་ཟེར་བ་དང་། ཨུད་པལ་ལྟར་གས་པ་དང་། པད་མ་ལྟར་གས་པ་དང་། པད་མ་ལྟར་གས་པ་ཆེན་པོར་སོང་ནས
en: Those that travel down go to the beings in the Reviving Hell, the Black Thread Hell , the Crushing Hell, the Shrieking Hell, the Screaming Hell, the Hot Hell, the Hell of Extreme Heat, the Hell of Ceaseless Agony, the Blistering Hell, the Bursting Blister Hell, the Hell of Chattering Teeth, the Hell of Lamentation, the Cold Whimpering Hell, the Splitting Open Like a Blue Lotus Hell, the Splitting Open Like a Lotus Hell, and the Splitting Open Like a Great Lotus Hell,

source: སྟེང་དུ་འགྲོ་བ་གང་ཡིན་པ་དེ་དག་ནི་རྒྱལ་ཆེན་བཞིའི་རིས་རྣམས་དང་སུམ་ཅུ་རྩ་གསུམ་རྣམས་དང་འཐབ་བྲལ་རྣམས་དང་དགའ་ལྡན་རྣམས་དང་། འཕྲུལ་དགའ་རྣམས་དང་། གཞན་འཕྲུལ་དབང་བྱེད་རྣམས་དང་། ཚངས་རིས་རྣམས་དང་། ཚངས་པའི་མདུན་ན་འདོན་པ་རྣམས་དང་། ཚངས་པ་ཆེན་པོ་རྣམས་དང་། འོད་ཆུང་རྣམས་དང་། ཚད་མེད་འོད་རྣམས་དང་། འོད་གསལ་རྣམས་དང་། དགེ་ཆུང་རྣམས་དང་། ཚད་མེད་དགེ་རྣམས་དང་། དགེ་རྒྱས་རྣམས་དང་། སྤྲིན་མེད་རྣམས་དང་། བསོད་ནམས་སྐྱེས་རྣམས་དང་། འབྲས་བུ་ཆེ་རྣམས་དང་། མི་ཆེ་རྣམས་དང་། མི་གདུང་རྣམས་དང་། གྱ་ནོམ་སྣང་རྣམས་དང་། ཤིན་ཏུ་མཐོང་རྣམས་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱི་བར་དུ་སོང་ནས
en: The rays of light that travel up go to the following gods: those of the Abodes of the Four Great Kings, the Heaven of the Thirty-Three, the Strifeless Heaven, Tuṣita Heaven, the Delighting in Creation Heaven, the Heaven of the Masters of Others’ Creations, and the Heaven of Brahmā’s Assembly; those of the realms called Brahmin Priests, Great Brahmā, Limited Splendor, Immeasurable Splendor, Radiant Heaven, Lesser Virtue, Immeasurable Virtue, Extensive Virtue, and the Cloudless Heaven; and those of the realms called Increasing Merit, Great Result , None Greater, Sorrowless, Sublime Vision, Great Vision, and Supreme .

source: འཆི་བདག་སྡེ་ནི་གཞོམ་པར་གྱིས། །གང་ཞིག་ཆོས་འདུལ་འདི་ཉིད་ལ། །བག་ཡོད་སྤྱོད་པར་བྱེད་པ་ནི། །སྐྱེ་བའི་འཁོར་བ་རབ་སྤངས་ནསསྡུག་བསྔལ་ཟད་པར་བྱེད་པར་འགྱུར། །
en: Those who mind their way along the path Of this Dharma and Vinaya Will abandon the round of rebirth And put an end to suffering.

source: དེ་ནས་འོད་ཟེར་དེ་དག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་བསྐོར་ནས།
en: Then the rays of light circle through the three-thousandfold universe and come back to the blessed ones.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཕྱི་བཞིན་འབྲང་སྟེ་གལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་འདས་པའི་ལས་ལུང་སྟོན་པར་བཞེད་ན་ནི་བཅོམ་ལྡན་འདས་ཀྱི་སྣམ་ལོགས་སུ་མི་སྣང་བར་འགྱུར་རོ། །
en: Should the blessed one wish to make a revelation about past deeds, they will disappear into the blessed one’s back.

source: གང་གི་དོན་དུ་དཔའ་བོ་འཛུམ་པ་སྟོན་མཛད་པ། །དེ་ནི་ཁྱོད་ལ་སྐྱེ་བོ་ཕལ་ཆེན་ཉན་པར་འཚལ། །
en: Hero, make it manifest so that many might pay heed.

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་བྲམ་ཟེ་གང་གིས་དེ་བཞིན་གཤེགས་པ་ལ་ཤིང་རྟ་བསྟབས་པ་མཐོང་ངམ།
en: Ānanda, did you see the brahmin who proffered his chariot to the Tathāgata?”

source: ཀུན་དགའ་བོ་བྲམ་ཟེ་འདི་ནི། དགེ་བའི་རྩ་བ་འདིས་བསྐལ་པ་བཅུ་གསུམ་གྱི་བར་དུ་ལོག་པར་ལྟུང་བར་མི་འགྱུར་ཏེ
en: “Ānanda, because of the root of virtue of this brahmin’s action, he will not fall to the lower realms for thirteen eons.

source: བསྐལ་པ་བཅུ་གསུམ་གྱི་བར་དུ་ལྷ་རྣམས་དང་མི་རྣམས་ཀྱི་ནང་དུ་ཉིང་མཚམས་སྦྱར་ཞིང་
en: For thirteen eons he will take rebirth among gods and humans.

source: རབ་ཏུ་འབྱུང་བར་འགྱུར་ལ། དེས་སློབ་དཔོན་མེད་པ་དང་མན་ངག་མེད་པར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་དང་འཐུན་པའི་ཆོས་སུམ་ཅུ་རྩ་བདུན་མངོན་དུ་བྱས་ནས
en: Then he will go forth and manifest the thirty-seven wings of enlightenment without a teacher or any instruction.

source: རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་ཏེ། རང་སངས་རྒྱས་ཤིང་རྟ་སྦྱིན་ཞེས་བྱ་བར་འགྱུར་རོ། །
en: He will manifest the enlightenment of a solitary buddha and become the solitary buddha known as He Who Gave a Chariot.

source: དེའི་སྦྱིན་པར་བྱ་བའི་ཆོས་ནི་འདི་ཡིན་ནོ།། །།
en: That is what shall come of his act of generosity.”

source: སྒམ་པོ་ཞེས་བྱ་བ་ནི།
en: The Story of Earnest

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་སེམས་ཅན་ཞིག་སེམས་ཅན་དམྱལ་བར་སྐྱེས་ཏེ་ལུས་ཆེ་ཞིང་དམུས་ལོང་དུ་འདུག་ལ་དེའི་ལུས་རིལ་གྱིས་རྨས་ཞུ་ལུབ་ཏུ་ཡོག་སྟེ།
en: When the Blessed One was in Śrāvastī, there was a certain being who was reborn as a blind hell being. The entirety of his immense body was covered by a continuous mass of sores, and worms bored into him from the crown of his head to the soles of his feet.

source: དེའི་སྤྱི་བོ་མན་ཆད་རྐང་མཐིལ་ཡན་ཆད་སྲིན་ཞུགས་པས་དེ་ནད་མ་བཟོད་ནས་ཕན་ཚུན་རྒྱུག་པར་བྱེད་ལ།
en: Unable to tolerate his condition, he ran to and fro.

source: དེ་གལ་ཏེ་ཐང་ལ་འགྲོ་ན་ནི། དེ་ལ་དེ་ཉིད་ནས་སེང་གེ་དང་། སྟག་དང་། གཟིག་དང་། དྲེད་ལ་སོགས་པ་ལྕགས་ཀྱི་མཆེ་བ་ཅན་དག་འབྱུང་བར་འགྱུར་ཏེདེ་དག་གིས་དེའི་ཤ་རྣམས་བཅད་ཅིང་བཅད་ཅིང་ཟའོ། །
en: When he fled to the plains, there were iron-fanged lions, tigers, leopards, and bears that tore into his flesh over and over again and fed on him.

source: དེ་སྟེ་ཆུ་ལ་འབོག་ན་ནི་དེ་ལ་དེ་ཉིད་ནས་ཆུ་སྲིན་མ་ཀ་ར་ལྕགས་ཀྱི་མཆེ་བ་ཅན་དག་འབྱུང་བར་འགྱུར་ཏེ། དེ་དག་གིས་ཀྱང་དེའི་ཤ་རྣམས་བཅད་ཅིང་བཅད་ཅིང་ཟའོ། །
en: When he submerged himself in the water, there were crocodiles with fangs of iron that tore into his flesh over and over again and fed on him.

source: དེ་སྟེ་སྟེང་གི་ནམ་མཁའ་ལ་འགྲོ་ན་ནི་དེ་ལ་དེ་ཉིད་ནས། བྱ་རོག་དང་བྱ་རྒོད་དང་ཆུན་ལག་ལྕགས་ཀྱི་མཆུ་ཅན་དག་འབྱུང་བར་འགྱུར་ཏེ། དེ་དག་གིས་ཀྱང་དེའི་ཤ་རྣམས་བཅད་ཅིང་བཅད་ཅིང་ཟའོ། །
en: When he fled into the sky above there were crows, vultures, and woodpeckers with beaks of iron that tore into his flesh over and over again and fed on him.

source: དེ་སྟེ་ནགས་སྟུག་པོའི་ནང་དུ་འགྲོ་ན་ནི་དེ་ལ་དེ་ཉིད་ནས་ཤིང་ཤལ་མ་ལིའི་ཚལ་འབྱུང་བར་འགྱུར་ཏེ། དེ་ལ་དེར་རལ་གྲི་དང་། མདུང་ཐུང་དང་། མདའ་བོ་ཆེ་དང་། རྡོ་རྗེ་རྩེ་གཅིག་པ་དང་། མདུང་ཁ་ལེབ་རྣམས་རླུང་གིས་སྤགས་ཏེ་དེའི་སྟེང་དུ་འབབ་བོ། །
en: When he fled into the dense forest, there were sword-leafed śālmali trees, and swords, spears, lances, single-tipped vajras, and flat-bladed spears that rose up on the wind and hailed down on him.

source: དེ་སྟེ་རྩིག་པའི་གསེབ་བམ་རིའི་སུལ་ལམ་བྱ་སྐྱིབས་དག་ཏུ་འགྲོ་བར་འདོད་ན་ཡང་དེ་ལ་དེ་ཉིད་ནས་ལས་ལས་སྐྱེས་པའི་མི་དག་འབྱུང་བར་འགྱུར་ཏེརལ་གྲི་དང་། མདུང་ཐུང་དང་། མདའ་བོ་ཆེ་དང་། རྡོ་རྗེ་རྩེ་གཅིག་པ་དང་། མདུང་ཁ་ལེབ་རྣམས་ཐོགས་ནས་དེའི་ལུས་ལ་འདེབས་ཏེ། དེ་དག་གིས་དེའི་ལུས་ཐམས་ཅད་བཅད་ཅིང་གཏུབ་པར་བྱེད་དེ།
en: When he tried to flee behind walls or into mountain ravines or into any kind of shelter there were human beings who were there because of their past actions that took up swords, spears, lances, single-tipped vajras, and flat-bladed spears, and struck, cut, and sliced his entire body.

source: རྒྱུ་དེས་ན་དེས་སྡུག་བསྔལ་དྲག་པ་དང་མི་བཟད་པ་དང་ཚ་བ་དང་ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་མྱོང་སྟེ། ཉམ་ཐག་པའི་སྐད་འབྱིན་ཅིང་ངུའོ། །
en: This caused him dreadful suffering and extreme, unbearable, excruciating agony, and he wept and wailed in torment.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ། རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ། མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ། འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ། སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ། ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི་ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: སུ་ནི་ཕོངས་པ་དང་ཉམ་ང་བ་དང་གནོད་པ་དང་ལྡན་སུ་ནི་ངན་སོང་དུ་གཞོལ་སུ་ནི་ངན་སོང་དུ་འབབ་སུ་ནི་ངན་སོང་དུ་བབ་སུ་ནི་
en: Who is destitute, in a dreadful state, and being harmed? Who is veering toward the lower realms? Who is descending through the lower realms? Who has descended to the lower realms?

source: ངས་ངན་སོང་ནས་ཕྱུང་སྟེ་མཐོ་རིས་དང་ཐར་པ་དང་འབྲས་བུ་ལ་གཞག་པར་བྱ།
en: Whom shall I pull up from the lower realms, and establish in the resultant state of heaven and liberation?

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་ནས། མཉན་དུ་ཡོད་པའི་སྐྱེ་བོ་ཕལ་པོ་ཆེ་འདུལ་བའི་དུས་ལ་བབ་ནས།
en: When the Blessed One focused his mind and the time had come to tame the inhabitants of Śrāvastī,

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ་ཅི་ཚར་གཅད་པས་འདུལ་བར་འགྱུར་རམ་འོན་ཏེ་བསྟོད་པས་འདུལ་བར་འགྱུར་རམ། འོན་ཏེ་སྐྱོ་བ་བསྐྱེད་པས་འདུལ་བར་འགྱུར་སྙམ་དུ་དགོངས་ནས།
en: he considered whether they would be tamed by subjugation, or whether they would be tamed by praise, or whether they would be tamed by disillusionment with saṃsāra.

source: སྐྱོ་བ་བསྐྱེད་པས་འདུལ་བར་འགྱུར་བར་བཅོམ་ལྡན་འདས་ཀྱིས་གཟིགས་ནས། དེ་དག་སྐྱོ་བ་བསྐྱེད་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱིས་སེམས་ཅན་དེ་རྫུ་འཕྲུལ་གྱིས་བཀུག་སྟེ།
en: When the Blessed One saw that they would be tamed by disillusionment with saṃsāra, he miraculously summoned that same being to engender their disenchantment.

source: ཆུ་ཀླུང་ཁང་ལྡན་གྱི་འགྲམ་དུ་བཞག་ན། དེར་ཡང་དེ་ནད་མི་བཟོད་ནས་ཕན་ཚུན་རྒྱུག་པར་བྱེད་ལ་
en: He set him down on the bank of the Ajiravatī River, and there as well he was unable to tolerate his condition and ran to and fro.

source: དེར་ཡང་དེ་གལ་ཏེ་ཐང་ལ་འགྲོ་ན་ནི་དེ་ལ་དེ་ཉིད་ནས་སེང་གེ་དང་སྟག་དང་། གཟིག་དང་དྲེད་ལ་སོགས་པ་ལྕགས་ཀྱི་མཆེ་བ་ཅན་དག་འབྱུང་བར་འགྱུར་ཏེདེ་དག་གིས་དེའི་ཤ་རྣམས་བཅད་ཅིང་བཅད་ཅིང་ཟའོ། །
en: When he fled to the plains, there were iron-fanged lions, tigers, leopards, and bears that tore into his flesh over and over again and fed on him.

source: དེ་སྟེ་ཆུར་འབོག་ན་ནི་དེ་ལ་དེ་ཉིད་ནས་ཆུ་སྲིན་མ་ཀ་ར་ལྕགས་ཀྱི་མཆེ་བ་ཅན་དག་འབྱུང་བར་འགྱུར་ཏེ། དེ་དག་གིས་ཀྱང་དེའི་ཤ་རྣམས་བཅད་ཅིང་བཅད་ཅིང་ཟའོ། །
en: When he submerged himself in the water, there were crocodiles with fangs of iron that tore into his flesh over and over again and fed on him.

source: དེ་སྟེ་སྟེང་གི་ནམ་མཁའ་ལ་འགྲོ་ན་ནི་དེ་ལ་དེ་ཉིད་ནས་བྱ་རོག་དང་བྱ་རྒོད་དང་ཆུན་ལག་ལྕགས་ཀྱི་མཆུ་ཅན་དག་འབྱུང་བར་འགྱུར་ཏེ། དེ་དག་གིས་ཀྱང་དེའི་ཤ་རྣམས་བཅད་ཅིང་བཅད་ཅིང་ཟའོ། །
en: When he fled into the sky above there were crows, vultures, and woodpeckers with beaks of iron that tore into his flesh over and over again and fed on him.

source: དེ་སྟེ་ནགས་སྟུག་པོའི་ནང་དུ་འགྲོ་ན་ནི་དེ་ལ་དེ་ཉིད་ནས་ཤིང་ཤལ་མ་ལིའི་ཚལ་འབྱུང་བར་འགྱུར་ཏེ། དེ་ལ་དེ་ཉིད་དུ་རལ་གྲི་དང་། མདུང་ཐུང་དང་། མདའ་བོ་ཆེ་དང་། རྡོ་རྗེ་རྩེ་གཅིག་པ་དང་། མདུང་ཁ་ལེབ་རྣམས་རླུང་གིས་སྤགས་ཏེ་དེའི་སྟེང་དུ་འབབ་བོ། །
en: When he fled into the dense forest, there were sword-leafed śālmali trees, and swords, spears, lances, single-tipped vajras, and flat-bladed spears that rose up on the wind and hailed down on him.

source: རྒྱུ་དེས་ན་སྡུག་བསྔལ་དྲག་པ་དང་། མི་བཟད་པ་དང་། ཚ་བ་དང་། ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་མྱོང་སྟེ་ཉམ་ཐག་པའི་སྐད་འབྱིན་ཅིང་ངུའོ། །
en: This caused him dreadful suffering and extreme, unbearable, excruciating agony, and he wept and wailed in torment.

source: དེ་ནས་དེའི་ཀུ་ཅོའི་སྒྲས་མཉན་དུ་ཡོད་པ་ཐམས་ཅད་གང་བར་གྱུར་ཏོ། །
en: All of Śrāvastī was filled with his cries.

source: མཉན་དུ་ཡོད་པའི་སྐྱེ་བོ་ཕལ་པོ་ཆེས་འཇིགས་སུ་རུང་བའི་སྒྲ་དེ་ལྟ་བུ་ཐོས་སོ། །
en: The people of Śrāvastī heard these dreadful sounds [and thousands upon thousands of people emerged from Śrāvastī and headed toward the source of the cries by the Ajiravatī River.]

source: ཐོས་ནས་ཀྱང་སེམས་ཅན་སྟོང་ཕྲག་དུ་མ་མཉན་དུ་ཡོད་པ་ནས་བྱུང་སྟེ། སྒྲ་གྲག་པའི་ལོགས་སུ་ཆུ་ཀླུང་ཁང་ལྡན་ག་ལ་བ་དེར་དོང་ནས་
en: [The people of Śrāvastī heard these dreadful sounds and] thousands upon thousands of people emerged from Śrāvastī and headed toward the source of the cries by the Ajiravatī River.

source: སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་གིས། ཐག་རིང་པོ་ཞིག་ནས་སེམས་ཅན་དེ་དེ་ལྟ་བུའི་གནོད་པའི་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བ་མཐོང་ངོ་། །
en: From a distance the people caught sight of the being that was in the throes of such agony,

source: མཐོང་ནས་ཀྱང་དེ་དག་གིས་བསམས་པ།
en: and when they saw him they wondered,

source: སེམས་ཅན་འདི་ལྟ་བུ་གནོད་པའི་སྡུག་བསྔལ་འདི་འདྲ་བ་ཉམས་སུ་མྱོང་བ་འདི་སུ་ཞིག་སྙམ་མོ། །
en: “Who is this being in the throes of such agony?”

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཤིང་གཞེས་ལ་འཚོ་བ་རྣམས་ནི་ཆོས་ཉིད་ཀྱིས་དུས་དུས་སུ། གཙུག་ལག་ཁང་དང་། དུར་ཁྲོད་དང་། རི་དང་ཆུ་ཀླུང་དག་ཏུ་རྒྱུ་ཞིང་གཤེགས་ཏེ་
en: Naturally, from time to time, to sustain themselves, the blessed buddhas make their way through the monasteries, charnel grounds, mountains, and rivers.

source: དོན་འདིའི་ཕྱིར། བཅོམ་ལྡན་འདས་ཆུ་ཀླུང་དུ་རྒྱུ་ཞིང་གཤེགས་པར་བཞེད་ནས
en: This is why the Blessed One, who wanted to visit the river,

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: said to Venerable Ānanda,

source: ཀུན་དགའ་བོ་སོང་ལ་དགེ་སློང་རྣམས་ལ་དེ་བཞིན་གཤེགས་པ་ནི་ཆུ་ཀླུང་དུ་རྒྱུ་ཞིང་གཤེགས་ཀྱིས་སུ་དེ་བཞིན་གཤེགས་པ་དང་ཐབས་ཅིག་ཏུ་རྒྱུ་ཞིང་འགྲོ་འདོད་པ་དེ་དག་ཆོས་གོས་དག་ཆོས་ཤིག་ཅེས་བསྒོ་ཤིག །
en: “Ānanda, go and give a message to the monks that the Tathāgata will visit the river. Inform them that those who wish to travel with the Tathāgata should prepare their robes.”

source: བསྒོ་ནས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་ཚོགས་ཀྱིས་ཞབས་འབྲིང་བྱས་ཏེ་དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ནས་ཆུ་ཀླུང་ཁང་ལྡན་ག་ལ་བ་དེར་གཤེགས་སོ། །
en: After he gave him these instructions and the monks were thus informed, the Blessed One set out for the Ajiravatī River surrounded and attended on by an assembly of monks.

source: དེ་ནས་སྐྱེ་བོའི་ཚོགས་ཀྱིས་ཐག་རིང་པོ་ནས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: When the people gathered there saw the Blessed One in the distance, [those without faith said,]

source: མཐོང་ནས་ཀྱང་མ་དད་པ་གང་ཡིན་པ་དེ་དག་ན་རེ་དགེ་སྦྱོང་གཽ་ཏ་མ་ལྟད་མོ་ལ་དགའ་བ་མེད་དོ་ཞེས་གྲག་ན་དེ་ཡང་ལྟད་མོའི་དབང་དུ་གྱུར་ཏེ་འོངས་སོ་ཞེས་ཟེར་རོ། །
en: [When the people gathered there saw the Blessed One in the distance,] those without faith said, “They say the mendicant Gautama takes no joy in spectacles, but such a spectacle as this lures even him.”

source: དད་པ་དང་ལྡན་པ་གང་ཡིན་པ་དེ་དག་ན་རེ་བཅོམ་ལྡན་འདས་སེམས་ཅན་འདི་ལས་བརྟེན་ཏེ་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་ཅིག་ལུང་སྟོན་པར་བཞེད་གོར་མ་ཆག་ཅེས་ཟེར་ནས།
en: Those with faith replied, “This being will surely be instrumental in an extraordinary Dharma teaching by the Blessed One.”

source: བཅོམ་ལྡན་འདས་ཀྱི་གདན་བཤམས་ཏེ་སྨྲས་པ། བཅོམ་ལྡན་འདས་ཚུར་གཤེགས།
en: They prepared a seat for the Blessed One, saying, “This way, Blessed One—if you please!

source: བཅོམ་ལྡན་འདས་གཤེགས་པ་ལེགས་སོ་ལེགས་སོ། །
en: Welcome, Blessed One, very good!

source: བཅོམ་ལྡན་འདས་གདན་བཤམས་པ་ལ་བཞུགས་སུ་གསོལ་ཞེས་ཟེར་རོ། །
en: O Blessed One, please have a seat on this cushion we have prepared for you!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་གདན་བཤམས་པ་ལ་བཞུགས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ། མ་ལ་བདག་སེམས་ཅན་འདི་ཅི་ནས་སྔོན་གྱི་ཚེ་རབས་རྗེས་སུ་དྲན་ལ་མིའི་སྐད་དུ་སྨྲ་ཞིང་བདག་དང་གཏམ་ཟེར་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་པར་བྱའོ་སྙམ་དུ་དགོངས་སོ། །
en: The Blessed One took his place on the seat prepared for him, and thought, “The best thing will be for me to enter into a meditation such that this being can remember his former lives and converse with me in a human tongue.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཅི་ནས་སེམས་ཅན་དེས་སྔོན་གྱི་ཚེ་རབས་དྲན་ལ་མིའི་སྐད་དུ་སྨྲ་ཞིང་། བཅོམ་ལྡན་འདས་དང་གཏམ་ཟེར་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས
en: So the Blessed One entered into a meditation such that that being remembered his former lives and could converse with him in a human tongue.

source: དེར་བཅོམ་ལྡན་འདས་ཀྱིས་སེམས་ཅན་དེ་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One addressed him, saying,

source: བཞིན་བཟངས་ཁྱོད་སྒམ་པོ་ཡིན་ནམ།
en: “My friend, are you Earnest ?”

source: བཅོམ་ལྡན་འདས་བདག་སྒམ་པོ་ལགས་སོ། །
en: “Yes, Blessed One, I am Earnest .”

source: བདེ་བར་གཤེགས་པ་བདག་སྒམ་པོ་ལགས་སོ། །
en: “O Sugata, I am Earnest .”

source: ལུས་དང་ངག་དང་ཡིད་ཀྱི་ཉེས་པར་སྤྱོད་པའི་ལས་རྣམས་ཀྱི་འབྲས་བུ་མྱོང་བ་ཡོད་དམ།
en: “Are you now experiencing the repercussions of your misconduct of body, speech, and mind?”

source: བཅོམ་ལྡན་འདས་མྱོང་བ་མཆིས་ལགས་སོ། །
en: “Indeed I am, Blessed One.”

source: ལུས་དང་ངག་དང་ཡིད་ཀྱི་ཉེས་པར་སྤྱོད་པའི་ལས་རྣམས་ཀྱི་འབྲས་བུ་མི་སྡུག་པ་ཡིན་ནམ།
en: “Are the repercussions of your misconduct of body, speech, and mind hideous?”

source: བདེ་བར་གཤེགས་པ་མི་སྡུག་པ་ལགས་སོ། །
en: “Yes, Blessed One, they are.”

source: ཁྱོད་ཀྱི་མི་དགེ་བའི་བཤེས་གཉེན་སུ་ཡིན། དེས་གསོལ་པ།
en: “Who guided you to such nonvirtue?”

source: རང་གི་སེམས་ལགས་སོ། །
en: “My own mind,” he replied.

source: དེ་ནས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Now, hearing this, the people wondered,

source: འདི་ལྟ་བུའི་སེམས་ཅན་སྔོན་གྱི་ཚེ་རབས་དྲན་ལ་མིའི་སྐད་དུ་སྨྲ་ཞིང་བཅོམ་ལྡན་འདས་དང་གཏམ་ཟེར་བ་འདི་སུ་ཞིག་སྙམ་མོ། །
en: “Who is this being who remembers his former lives and converses with the Blessed One in a human tongue?”

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སྙན་སླེབས་པར་དཀའ་སྟེ།
en: The ears of the blessed buddhas are difficult to reach,

source: དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སྙན་དུ་ཞུ་མ་ནུས་ནས་དེ་དག་གིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་དྲིས་པ།
en: so since they were not able to put their question to the Blessed One they inquired of Venerable Ānanda,

source: བཙུན་པ་ཀུན་དགའ་བོ་འདི་ལྟ་བུའི་སེམས་ཅན་སྔོན་གྱི་ཚེ་རབས་དྲན་ལ་མིའི་སྐད་དུ་སྨྲ་ཞིང་། བཅོམ་ལྡན་འདས་དང་གཏམ་ཟེར་བ་འདི་སུ་ཞིག །
en: “Lord Ānanda, who is this being who remembers his former lives and converses with the Blessed One in a human tongue?”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་སྨྲས་པ། བཅོམ་ལྡན་འདས་ལ་ཞུས་ཤིག །དེ་དག་གིས་སྨྲས་པ།
en: “Put your question to the Blessed One,” Venerable Ānanda replied.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སྙན་སླེབས་པར་དཀའ་ཞིང་གཟི་བྱིན་བཟོད་པར་དཀའ་བས་བདག་ཅག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་སྙན་དུ་ཞུ་མི་ནུས་སོ། །
en: “The ears of the blessed buddhas are difficult to reach, and his presence is overwhelming. We cannot ask the Blessed Buddha ourselves,” they said.

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་སྨྲས་པ།
en: Venerable Ānanda replied,

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བདག་གིས་ཀྱང་སྙན་སླེབས་པར་དཀའ་མོད་ཀྱི། འོན་ཀྱང་ཁྱེད་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་ཞུ་བར་བགྱིའོ་ཞེས་སྨྲས་ནས
en: “Though the ears of the blessed buddhas are difficult to reach for me as well, out of compassion for you I shall ask.”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Venerable Ānanda drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together,

source: བཙུན་པ་འདི་ལྟ་བུའི་སེམས་ཅན་སྔོན་གྱི་ཚེ་རབས་དྲན་ལ་མིའི་སྐད་དུ་སྨྲ་ཞིང་། བཅོམ་ལྡན་འདས་ལ་བཀའ་མཆིད་གསོལ་པ་འདི་སུ་ཞིག་ལགས།
en: and inquired of the Blessed One, “Lord, who is this being who remembers his former lives and converses with the Blessed One in a human tongue?”

source: དེར་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: At that, the Blessed One spoke to Venerable Ānanda, saying, “Ānanda, this being is one who committed nonvirtuous actions over and over again.

source: ཀུན་དགའ་བོ་སེམས་ཅན་འདི་ནི་སྡིག་པའི་ལས་བྱེད་བྱེད་པ་ཡིན་ཏེའདིས་སྡིག་པའི་ལས་མང་དུ་བྱས་སོ། །
en: The nonvirtuous actions he committed were manifold.

source: ཀུན་དགའ་བོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་པ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་ཟེར་ཅན། ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེདེའི་ཚེ་དགྲ་བཅོམ་པ་ཞིག་དགྲ་བཅོམ་པ་ལྔ་བརྒྱ་དང་ཐབས་ཅིག་ཏུ་ལྗོངས་རྒྱུ་ཞིང་སོང་བ་ལས་རྒྱལ་པོའི་ཕོ་བྲང་ཞིག་ཏུ་ཕྱིན་ནས། དེ་དག་རྒྱལ་པོ་དེའི་སྐྱེད་མོས་ཚལ་དུ་སོང་སྟེ།
en: “Ānanda, in times past when the one who transcended the levels of the listeners and solitary buddhas, the totally and completely awakened buddha, the blessed one, the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Prabhāvan was in the world, there was a certain arhat who, as he made his way through the countryside with a group of five hundred arhats, came to the royal palace, where they entered the royal gardens.

source: རྒན་རིམས་བཞིན་དུ་ཤིང་དྲུང་རེ་རེར་རྩྭ་བཏིང་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་བདེ་བ་ཉམས་སུ་མྱོང་བར་བྱེད་དོ། །
en: “One by one, according to age, they spread grass beneath a different tree, crossed their legs, and knew bliss as they entered states of concentration, liberation, meditation, and equipoise.

source: དེ་ནས་དེའི་ཚེ་རྒྱལ་པོའི་ཕོ་བྲང་དེ་ཉིད་ན་རྒྱལ་པོ་སྒམ་པོ་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ།
en: “Now at this time, a certain King Earnest reigned in that very palace.
